{
  "expertise": "ექსპერტიზა",
  "history": "კარიერა",
  "projects": "პროექტები",
  "contact": "საკონტაქტო",

  "name": "ბესო ქელეხსაევი",
  "pro": "Full Stack ინჟინერი",
  "career_history": "კარიერული გზა",
  "timeline2017": "რეცეფშენის ოპერატორი საცხოვრებელ კომპლექსში",
  "timeline2017_desc": "მიმღები ოპერატორობა, ტელეფონის ხაზების მართვა და მცხოვრებლების მოთხოვნების კოორდინაცია.",

  "timeline2020": "აუტისტური სპექტრის მქონე ბავშვის პირადი ასისტენტი",
  "timeline2020_desc": "დახმარება ყოველდღიურ საქმიანობაში, სწავლის პროცესის მხარდაჭერა და პერსონალური მოვლა.",

  "timeline2022": "EuropeBet-ის ჩატ-ოპერატორი",
  "timeline2022_desc": "ონლაინ მომხმარებელთა მხარდაჭერა, ჩატში შეტყობინებების მართვა და მომხმარებლის გამოცდილების გაუმჯობესება.",

  "timeline2024": "აუტისტური სპექტრის მქონე ბავშვის პირადი ასისტენტი",
  "timeline2024_desc": "დახმარება ყოველდღიურ რუტინაში, სასწავლო აქტივობებში და სოციალური უნარების განვითარებაში.",

  "timeline20242": "დამოუკიდებელი ტრეიდერი",
  "timeline2024_desc2": "კრიპტოვალუტის ფარმინგისა და მცირე მასშტაბის სავაჭრო ოპერაციების მართვა, ბაზრების ანალიზი და სტრატეგიების ოპტიმიზაცია.",

  "tbilisi": "თბილისი",

  "fullstack": "დამოუკიდებლად შევქმენი სხვადასხვა ტიპის ვებ-აპლიკაციები თანამედროვე ტექნელოგიების გამოყენებით, როგორიცაა React, Next.js და Node/Express. მაქვს გამოცდილება პროგრამული უზრუნველყოფის განვითარების სრული ციკლის (SDLC) შესახებ, Frontend და Backend მიმართულებებში.",
  "devops": "აპლიკაციის შექმნის შემდეგ შემიძლია DevOps ტესტირების, CI/CD პაიპლაინების და დეპლოის ავტომატიზაციის კონფიგურაცია, რაც უზრუნველყოფს წარმატებულ Go-Live პროცესს.",
  "genai": "ვიყენებ თანამედროვე AI ტექნოლოგიებს და ჩემს პროექტებში ვაინტეგრირებ Hugging Face-ისა და OpenAI-ის მოდელებს. მაქვს პრაქტიკული გამოცდილება GenAI-ზე დაფუძნებული ფუნქციების შექმნაში, რომლებიც გადაწყვეტილების მიღებასა და აპლიკაციის შესაძლებლობების გაუმჯობესებას უწყობს ხელს.",
  "echo": "Full-stack სოციალური პლატფორმა, შექმნილი Next.js-ის, Express-ის და MongoDB-ის გამოყენებით. აპში არის ავტორიზაცია, პოსტები, კომენტარები, ლაიქები, პროფილები და რეალურ დროში ფუნქციები WebSockets-ის საშუალებით. ასევე ინტეგრირებულია OpenAI-ის მოდელები, რომლებიც მომხმარებლებს ეხმარება კონტენტის გენერაციასა და დისკუსიებში. შექმნილია უსაფრთხო REST API-ები, მონაცემთა ბაზის სტრუქტურა და რეზპონსიული, მოსახერხებელი ინტერფეისი.",
  "oasis": "კურორტის აპლიკაცია, სადაც მომხმარებლებს შეუძლიათ დაჯავშნონ კაბინები და ისიამოვნონ ბუნებაში დასვენებით. აპლიკაცია შექმნილია Next.js-ზე, მონაცემების შენახვა ხდება Supabase-ში, აუტენტიფიკაცია კი ხორციელდება Google Auth-ით.",
  "oasisadmin": "Wild Oasis Admin Panel — ეს არის მართვის პანელი, რომელიც გამოიყენება Wild Oasis-ის კურორტის ყველა პროცესის სამართავად. ადმინისტრატორს შეუძლია მართოს კაბინები, ნახოს და შეცვალოს ბრონები, თვალყური ადევნოს სტუმრებს, განაახლოს ფასები და ნახოს მთავარი სტატისტიკა. პროექტი შექმნილია Next.js და Supabase გამოყენებით.",
  "worldwise": "WorldWise არის ვებ-აპლიკაცია მოგზაურობისთვის, რომელიც საშუალებას აძლევს მომხმარებლებს გამოიკვლიონ, დაამატონ და მართონ ქალაქები მსოფლიოს სხვადასხვა კუთხეში. მომხმარებლებს შეუძლიათ ნახონ ქალაქები რუკაზე, მიიღონ დეტალური ინფორმაცია თითოეული ქალაქის შესახებ და დაამატონ ახალი ქალაქები შენიშვნებითა და კოორდინატებით.",
  "pmenu": "Pizza Ordering Simulator — React-ზე შექმნილი ვებ-აპლიკაცია, რომელიც სიმულირებს პიცის შეკვეთის პროცესს. მომხმარებლებს შეუძლიათ მენიუს ნახვა, შეკვეთის მიმოხილვის ნახვა და სიმულირებული შეკვეთის განხორციელება.",
  "contactme": "დამიკავშირდი",
  "contacttext": "გაქვს პროექტი, რომლის განხორციელებაც გსურს? მოდი, ერთად ვაქციოთ რეალობად!",
  "fbai": "ეს არის full-stack ვებ-პროექტი, საფეხბურთო მატჩების პროგნოზებისთვის.მომხმარებლებს შეუძლიათ დაერეგისტრირება და შესვლა სისტემაში უსაფრთხო ავტორიზაციით, რომელიც აწყობილია Express sessions, MongoDB და Redis-ზე (სესიის სწრაფი და სტაბილური შენახვისთვის).მატჩების რეალური მონაცემები მოდის FootballAPI-დან, ამიტომ მომხმარებელი ყოველთვის ხედავს განახლებულ ინფორმაციას თამაშებზე. პროგნოზებისთვის გამოიყენება ChatGPT(gpt-3.5 turbo), რომელიც აანალიზებს მიწოდებულ ინფორმაციას და თითოეული თამაშისთვის ქმნის ჭკვიან პროგნოზს.მომხმარებელს შეუძლია ნახოს თამაშები, მიიღოს პროგნოზები, შეინახოს და მერე დაბრუნდეს — სესიის მონაცემებს საიმედოდ ინახავს Redis.",
  "send": "გაგზავნა",
  "front": "მე ვქმნი რესპონსიულ და ინტერაქტიულ ინტერფეისებს თანამედროვე ტექნოლოგიებით, როგორიცაა React, Next.js, TypeScript და Tailwind CSS. მიყვარს სუფთა და მარტივად მართვადი კოდის შექმნა, რომელიც მომხმარებელს საშუალებას აძლევს გამოიყენოს აპლიკაცია ეფექტურად და კომფორტულად.",
  "back": "შემიძლია მყარი და საიმედო backend სისტემების შექმნა ტექნელოგიების გამოყენებით როგორებიცაა: Node.js, Express და მონაცემთა ბაზები (MongoDB და PostgreSQL). ვქმნი RESTful API-ებს, ვმართავ მონაცემთა შენახვას და ვზრუნავ უსაფრთხო და ეფექტურ სერვერულ ოპერაციებზე, რა თქმა უნდა აპლიკაციის frontend მოთხოვნილებების გათვალისწინებით.",
  "database": "ვმართავ მონაცემთა ბაზებს SQL (PostgreSQL, MySQL) და NoSQL (MongoDB) ტექნოლოგიების გამოყენებით. ვზრუნავ მონაცემთა მთლიანობაზე, ვოპტიმიზირებ კითხვის პროცესს და ვქმნი ეფექტურ მონაცემთა მოდელებს."
}
