{
  "expertise": "Экспертиза",
  "history": "Карьера",
  "projects": "Проекты",
  "contact": "Контакты",

  "name": "Бесо Келехсаеви",
  "pro": "Full Stack инженер",
  "career_history": "Карьера",
  "timeline2017": "Оператор на ресепшене в жилом комплексе",
  "timeline2017_desc": "Обрабатывал запросы посетителей, отвечал на звонки и координировал запросы жильцов.",

  "timeline2020": "Личный ассистент ребенка с аутическим спектром",
  "timeline2020_desc": "Помогал в повседневных делах, поддерживал обучение и обеспечивал персонализированную заботу.",

  "timeline2022": "Чат-оператор в EuropeBet",
  "timeline2022_desc": "Обеспечивал онлайн-поддержку клиентов, управлял чат-запросами и улучшал пользовательский опыт.",

  "timeline2024": "Личный ассистент ребенка с аутическим спектром",
  "timeline2024_desc": "Помогал с повседневными задачами, образовательными активностями и развитием социальных навыков.",

  "timeline20242": "Независимый трейдер",
  "timeline2024_desc2": "Управлял криптовалютным фармингом и мелкой торговлей, анализируя рынки и оптимизируя стратегии.",

  "tbilisi": "Тбилиси",
  "fullstack": "Я разработал разнообразные веб-приложения с нуля, используя современные технологии, такие как React, Next.js и Node/Express. Обладаю хорошей компетентностью во всём цикле разработки ПО (SDLC), в frontend и backend разработке.",
  "devops": "После создания приложения я могу настроить DevOps-тестирование, CI/CD-пайплайны и автоматизацию деплоя, что обеспечивает успешный процесс Go-Live.",
  "genai": "Я использую современные AI-технологии и интегрирую модели Hugging Face и OpenAI в свои проекты. Имею практический опыт в создании решений с использованием GenAI, которые помогают автоматизировать задачи и улучшать принятие решений.",
  "echo": "Полноценная full-stack социальная платформа на базе Next.js, Express и MongoDB. Реализованы авторизация пользователей, посты, комментарии, лайки, профили, а также функции в реальном времени через WebSockets. Интегрированы AI-инструменты на основе моделей OpenAI для генерации подсказок и помощи пользователям в обсуждениях. Настроены безопасные REST API, структура БД и адаптивный интерфейс.",
  "oasis": "приложение для курорта, где пользователи могут забронировать домики и насладиться отдыхом на природе. Приложение построено на Next.js, данные хранятся в Supabase, а аутентификация реализована через Google Auth.",
  "oasisadmin": "Wild Oasis Admin Panel — это админ-панель для управления всем, что происходит “за кулисами” курорта Wild Oasis. Администраторы могут управлять домиками, просматривать и редактировать бронирования, следить за гостями, обновлять цены и просматривать ключевую статистику — всё через удобный и понятный интерфейс.Проект использует Next.js и Supabase .",
  "worldwise": "WorldWise — это веб-приложение для путешествий, позволяющее пользователям исследовать, добавлять и управлять городами по всему миру. Пользователи могут просматривать города на карте, получать подробную информацию о каждом городе и добавлять новые города с заметками и координатами.",
  "pmenu": "Pizza Ordering Simulator — веб-приложение на React, имитирующее процесс заказа пиццы. Пользователи могут просматривать меню, настраивать пиццу с разными ингредиентами, видеть сводку заказа и имитировать оформление покупки.",
  "contactme": "Свяжитесь со мной",
  "contacttext": "Есть проект, который ждёт реализации? Давайте сотрудничать и воплотим его в жизнь!",
  "fbai": "Этот проект — полноценное веб-приложение для прогнозов футбольных матчей. Пользователи могут регистрироваться и входить в систему через безопасную авторизацию, построенную на Express sessions, MongoDB и Redis, который используется как хранилище сессий для скорости и стабильности.Приложение получает реальные данные матчей через FootballAPI, поэтому пользователи всегда видят актуальные игры, таблицы и статистику.Для прогнозов используется ChatGPT, который анализирует информацию о матче и генерирует умный прогноз.Пользователь может просматривать матчи, запрашивать прогнозы, сохранять их и возвращаться позже — сессии надежно хранятся в Redis.",
  "send": "Отправить",
  "front": "Я создаю адаптивные и интерактивные пользовательские интерфейсы с использованием современных фронтенд-технологий, таких как React, Next.js, TypeScript и Tailwind CSS. Я сосредоточен на обеспечении бесшовного пользовательского опыта при поддержании чистого, масштабируемого и удобного для сопровождения кода.",
  "back": "могу разработать надежные бэкенд-системы с использованием Node.js, Express и баз данных, таких как MongoDB и PostgreSQL. Я проектирую и реализую RESTful API, обрабатываю хранение данных и обеспечиваю безопасные и эффективные серверные операции для поддержки фронтенд-приложений.",
  "database": "Я проектирую и управляю базами данных с использованием как SQL (PostgreSQL, MySQL), так и NoSQL (MongoDB) технологий. Я обеспечиваю целостность данных, оптимизирую запросы и реализую эффективные модели данных для поддержки требований и производительности приложений."
}
